In [ ]:
# 

import pandas as pd

# use pandas to read csv

data = pd.read_csv('example.csv')

data

:

In [3]:
print(type(data))

# data is a pandas.core.frame.DataFrame

<class 'pandas.core.frame.DataFrame'>

In [8]:
# Look at the first 5 rows in a data frame

data.head()

# is the same as data head 5. 5 is the default
data.head(5)

   account_number          title     type  amount        date
0               1  Another title  Expense  -20000  01-03-2021
1               1      Something  Expense  -20000  01-01-2021
2               1        A Title   Income   80000  01-02-2021
3               1    New Expense  Expense  -60000  01-03-2022
4               2   A new income   Income  100000  01-03-2022

In [9]:
# Describe gives the basic statistical information in a data set
# count, mean, std, min, max and 25%, 50% and 75%

data.describe()

       account_number         amount
count        9.000000       9.000000
mean       138.444444    4216.666667
std        410.833638   55738.205030
min          1.000000  -60000.000000
25%          1.000000  -20000.000000
50%          2.000000  -17000.000000
75%          2.000000   30000.000000
max       1234.000000  100000.000000

In [10]:
data.columns

Index(['account_number', 'title', 'type', 'amount', 'date'], dtype='object')

In [11]:
data.count()

account_number    9
title             9
type              9
amount            9
date              9
dtype: int64

In [12]:
# display the data types

data.dtypes

account_number     int64
title             object
type              object
amount             int64
date              object
dtype: object

In [5]:
# select a portion of our data as a dataframe

data[['title']]

                       title
0              Another title
1                  Something
2                    A Title
3                New Expense
4               A new income
5              A new expense
6  A brand new income source
7               Some expense
8       New expense for 1234

In [6]:
# select portion of our data as a series

data['title']

0                Another title
1                    Something
2                      A Title
3                  New Expense
4                 A new income
5                A new expense
6    A brand new income source
7                 Some expense
8         New expense for 1234
Name: title, dtype: object

In [14]:
# the data['title'] object is a series.

print(type(data['title']))

<class 'pandas.core.series.Series'>

In [19]:
# filtering: get all the incomes
data[data['type'] == 'Income'] #write the condition first, then bracket it with the data [] wrapper

   account_number                      title    type  amount        date
2               1                    A Title  Income   80000  01-02-2021
4               2               A new income  Income  100000  01-03-2022
6               2  A brand new income source  Income   30000  09-10-2022

In [20]:
# grab values where amount is positive

data[data['amount'] > 0]

   account_number                      title    type  amount        date
2               1                    A Title  Income   80000  01-02-2021
4               2               A new income  Income  100000  01-03-2022
6               2  A brand new income source  Income   30000  09-10-2022

In [35]:
# filter titles that start with "A"

data[data['title'].str.startswith("A")]

   account_number                      title     type  amount        date
0               1              Another title  Expense  -20000  01-03-2021
2               1                    A Title   Income   80000  01-02-2021
4               2               A new income   Income  100000  01-03-2022
5               2              A new expense  Expense  -55000  09-09-2022
6               2  A brand new income source   Income   30000  09-10-2022